#!/bin/sh
#------------------------------------------------------------main--------------------------------------------
cd /data

echo "#####执行EV9000配置数据数据库备份脚本:开始#####"

echo "*******************************************************************"

echo "一.删除源数据库中的触发器:开始---"

. /app/Delete_trig.sh

echo "一.删除源数据库中的触发器:结束---"

echo "*******************************************************************"

echo "二.执行备份数据库命令:开始---"

mysqldump -uroot -pwiscom --host=$1 --opt EV9000DB | mysql -uroot -pwiscom --host=$2 -C EV9000DB

echo "二.执行备份数据库命令:结束---"

echo "*******************************************************************"

echo "三.恢复源数据库中的触发器:开始---"

. /app/Create_trig.sh

echo "三.恢复源数据库中的触发器:结束---"

echo "*******************************************************************"

echo "#####执行EV9000配置数据数据库备份脚本:结束#####"