#!/bin/sh
#------------------------------------------------------------main--------------------------------------------
cd /data

echo "#####执行录像记录表数据库备份脚本:开始#####"

echo "*******************************************************************"

echo "一.执行备份数据库命令:开始---"

mysqldump -uroot -pwiscom --host=$1 --opt EV9000TSU | mysql -uroot -pwiscom --host=$2 -C EV9000TSU

echo "一.执行备份数据库命令:结束---"

echo "*******************************************************************"

echo "#####执行录像记录表数据库备份脚本:结束#####"